{
	"blogs": [{
		"key": 1,
		"title": "My 9/11 story",
		"date": "Sunday, September 18, 2011",
		"body": "I didn't even think to write a post on this, but my friend Cindy's blog inspired me. I was living and working in Northern Virginia. Jen worked in Washington DC. My day had already started off with some tension. Rumor around my company that day was that a big round of layoffs was coming. No one knew who was getting laid off, so it was pretty tense. Layoffs started right away. If your manager came and tapped you on the shoulder, it was bad. You both had to take a long walk to HR and talk about your severance package. Word around the office was about the people who had been let go already. After about an hour though, the conversation had changed. There was some talk of a plane crash. When I heard that it was into one of the World Trade Center buildings, it was pretty surreal being a NYer. Lots of us were trying to get to news web sites, but the internet was slow that morning. Lots of web traffic trying to see what was going on. My immediate thought was some plane malfunction, but I wondered a bit because planes don't usually come that close to the city skyline. The news turned for the worse when the second plane crashed. At that point I knew this was no accident. Something really bad was happening. At this point, our company was in full layoff mode. Somewhere around 5 people had been let go so far. The total number to be let go was in the low 20's. I don't think management knew what to do at this point, so they just plugged along and kept doing their job. A large group of us stood in a conference room watching CNN's coverage of the burning towers. I was pretty shell shocked watching them burn. I've grown up looking at that skyline, but it never looked like that. I've spent time in the building visiting friends that worked there over the years. I've had several visits to the observation deck in my lifetime. The site was really unbearable for me. Watching people jumping instead of burning was the worst. I can't imagine having to make that decision. It was heart wrenching. The next hour is a bit blurry for me. Sometime either before or after the pentagon got hit by the third plane, I got that manager tap on the shoulder. I almost didn't care at this point. Let's just get this over with. I wasn't thinking about the fact that the economy was going to be devastated by this. I wasn't thinking about how hard it was going to be trying to find a job in the months after what we now know is the worst tragedy to ever hit the United States of America in our history. I wasn't worrying about the fact that I may not be able to provide for my pregnant wife and the new house we just bought. Our first child and first house. I was more concerned with Jen's and Robbie's safety. There was another plane out there. The news was speculating on a target. Everyone was sure it was something in DC. That's where Jen worked. She was across from the World Bank and only a couple of blocks from the White House. I had a hard time getting a hold of her. Both cell lines and land lines were overwhelmed. I do remember talking to her at one point. They were evacuating DC. She was going to have to walk, though. Out of DC and into Alexandria. That was the only way to get the metro. My layoff was over, but I didn't care. They thankfully allowed us time to stay in the building. A bunch of us headed up to the roof of our building on this outdoor patio where we had weekly, company sponsored, Friday happy hour parties. There was no happy hour today. We went to see the Pentagon. We were in McLean, so all we could see was smoke off in the distance coming from a building, but we knew what we were looking at was the burning Pentagon. Back downstairs, the news was showing the crumbling Towers. My mind was racing. I was devastated. The skyline at which I grew up staring would be altered forever. It had been altered forever. These cowards had destroyed a symbol of our great culture, but more importantly, they murdered thousands of innocent people. The month after that day was very stressful. The post-9/11 world was so different. Job hunting was scary. The job I had been laid off from came along with 3 other job offers just 9 months earlier. Now I even had a hard time finding interviews. The couple of months before this, the many blessings I had in my life were steering me back to God. I mention this only because what happened in this month can only be described as another blessing. I was given a severance package and some owed vacation time. That paid me through October 15th. That week I found a job. My new start date? October 16th. In the aftermath of this great tragedy, I was blessed to land on my feet and be able to provide for my family. I only mention this because it's part of my story. I guess the best thing out of all this is that my story is not much different than the others. All Americans felt the tragedy that day. Some lost family members. Some lost jobs. Some lost cherished memories. But we all continued our lives. We all moved forward. No one let this attack defeat us. Say what you want about our country, but I see lots of great people. There were lots of heroes that day, and the days after. That's what makes our country great. On a day when terrorist tried to rip our country apart, what they did was make us one. That day we were all Americans."
	}, {
		"key": 2,
		"title": "I guess we're raising them right",
		"date": "Monday, September 29, 2008",
		"body": "This will be short, but I had to share this. We were at the JumpZone the other night for an open play being sponsored by the Autism Society. Robbie had done something cute, and some woman looks at him and says, 'The future of America.' Robbie responded with, 'Barack the Vote!', which was a very appropriate phrase based on what she said. The funny part of this, was that the woman was wearing a McCain-Palin t-shirt!!!"
	}, {
		"key": 3,
		"title": "I'm awesome!",
		"date": "Wednesday, August 27, 2008",
		"body": "Robbie had a dentist appointment today. Just a cleaning and a check up. He was a bit scared, though, as the last couple of trips involved getting two cavities filled. We assured him that he wasn't going to get a needle, but he was still apprehensive about laying in the chair. The nurse saw something in his chart and asked what PDDNOS was. We explained to her that meant he had autism. Robbie turned to them and said, 'No, I'm AWESOME!' I look at him now and think back to where he was when we first heard the letters PDDNOS. We had no clue what that meant. When the neurologist said it was part of the autism spectrum, my body went numb. When we did our research, most of it pointed to him probably never talking. Here we are today, and he heard autism, and said 'No, I'm awesome.' And he is. He amazes me everyday at what he does and how hard he works. The things that are so simple to us are hard work for him, yet he makes them seem so simple sometimes. Even though his brain doesn't work like ours. He's found a way to get past that to the point where the nurse was surprised to hear that he has autism. Most people are when they meet him. He is very awesome!"
	}]
}